package com.eomcs.basic.ex05;

// 비트 이동 연산자 >>
public class Exam0420a {
  public static void main(String[] args) {
    int i = 105; //00000000 00000000 00000000 01101001
    
    System.out.println(i);
    
    System.out.println(i >> 1);
    // [ 0000000000000000000000000110100]1
    // [00000000000000000000000000110100]    => 52
    
    System.out.println(i >> 2);
    // [  000000000000000000000000011010]01
    // [00000000000000000000000000011010]    => 26

    System.out.println(i >> 3);
    // [   00000000000000000000000001101]001
    // [00000000000000000000000000001101]    => 13

    System.out.println(i >> 4);
    // [    0000000000000000000000000110]1001
    // [00000000000000000000000000000110]    => 6
    
    // 앞쪽의 수를 채울때 부호비트에 맞춰서 채운다.
    
  }
}
